// SoundManager.cs 
//
// @idev Unity2017.1.0f3 / MonoDevelop5.9.6
// @auth FCEI.No-Va
// @date 2017/08/19
//
// Copyright (C) 2017 FlyteCatEmotion Inc.
// All Rights Reserved.
//------------------------------------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//----------------------------------------------------------------------------------------------------
// 音の管理 
//----------------------------------------------------------------------------------------------------
public class SoundManager : MonoBehaviour
{
	//--------------------------------------------------------------------------------
	// 効果音 ジングル 
	//--------------------------------------------------------------------------------
	public enum SE
	{
		START,
		WALK,
		ATTACK,
		HIT,
		GET,
		DAMAGE,
		RESULT,
	}

	//--------------------------------------------------------------------------------
	// BGM 
	//--------------------------------------------------------------------------------
	public enum BGM
	{
		MAIN,
	}

	//--------------------------------------------------------------------------------
	// メンバ変数 
	//--------------------------------------------------------------------------------
	static SoundManager instance;           // シングルトンインスタンス

	[SerializeField]AudioSource[] seList;   // 効果音のリスト 
	[SerializeField]AudioSource[] bgmList;  // BGM1のリスト 



	//--------------------------------------------------------------------------------
	// コンストラクタ 
	//--------------------------------------------------------------------------------
	void Awake()
	{
		// シングルトン作成 
		if(instance == null) {
			instance = this;
			DontDestroyOnLoad(this.gameObject);
		}
		else {
			GameObject.Destroy(this.gameObject);
		}
	}



	//--------------------------------------------------------------------------------
	// SE再生 
	//--------------------------------------------------------------------------------
	public static void PlaySE(SE se)
	{
		instance.seList[(int)se].Play();
	}



	//--------------------------------------------------------------------------------
	// BGM再生 
	//--------------------------------------------------------------------------------
	public static void PlayBGM(BGM bgm, bool isMix = false)
	{
		if(!isMix){ StopBGM(); }
		instance.bgmList[(int)bgm].Play();
	}



	//--------------------------------------------------------------------------------
	// BGM停止 
	//--------------------------------------------------------------------------------
	public static void StopBGM()
	{
		for(int i = 0; i < FCEI.Enums<BGM>.Length; i++) {
			StopBGM((BGM)i);
		}
	}
	public static void StopBGM(BGM bgm)
	{
		instance.bgmList[(int)bgm].Stop();
	}
}
