// SoundManager.cs 
//
// @idev Unity2017.1.0f3 / MonoDevelop5.9.6
// @auth FCEI.No-Va
// @date 2017/08/19
//
// Copyright (C) 2017 FlyteCatEmotion Inc.
// All Rights Reserved.
//------------------------------------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//----------------------------------------------------------------------------------------------------
// 音の管理 
//----------------------------------------------------------------------------------------------------
public class SoundManager : MonoBehaviour
{
	//--------------------------------------------------------------------------------
	// 効果音 ジングル 
	//--------------------------------------------------------------------------------
	public enum SE
	{
		START,		// ゲーム開始音 
		WALK,		// 歩く 
		WALKSNOW,   // 雪の上を歩く 
		ATTACK,		// 攻撃(鼻息) 
		HIT,		// 攻撃ヒット 
		GET,		// 枝ゲット 
		DAMAGE,		// ダメージを受ける 
		RESULT,		// 結果表示(やられ) 
		FIRE,		// 火に枝を追加 
	}

	//--------------------------------------------------------------------------------
	// BGM 
	//--------------------------------------------------------------------------------
	public enum BGM
	{
		TITLE,		// タイトル画面 
		HOME,		// 家の中 
		MAIN,		// 外(雪の音) 
	}

	//--------------------------------------------------------------------------------
	// メンバ変数 
	//--------------------------------------------------------------------------------
	static SoundManager instance;           // シングルトンインスタンス

	[SerializeField]AudioSource[] seList;   // 効果音のリスト 
	[SerializeField]AudioSource[] bgmList;  // BGM1のリスト 



	//--------------------------------------------------------------------------------
	// コンストラクタ 
	//--------------------------------------------------------------------------------
	void Awake()
	{
		// シングルトン作成 
		if(instance == null) {
			instance = this;
			DontDestroyOnLoad(this.gameObject);
		}
		else {
			GameObject.Destroy(this.gameObject);
		}
	}



	//--------------------------------------------------------------------------------
	// SE再生 
	//--------------------------------------------------------------------------------
	public static void PlaySE(SE se)
	{
		instance.seList[(int)se].Play();
	}



	//--------------------------------------------------------------------------------
	// BGM再生 
	//--------------------------------------------------------------------------------
	public static void PlayBGM(BGM bgm, bool isMix = false)
	{
		if(!isMix){ StopBGM(); }
		instance.bgmList[(int)bgm].Play();
	}



	//--------------------------------------------------------------------------------
	// BGM停止 
	//--------------------------------------------------------------------------------
	public static void StopBGM()
	{
		for(int i = 0; i < FCEI.Enums<BGM>.Length; i++) {
			StopBGM((BGM)i);
		}
	}
	public static void StopBGM(BGM bgm)
	{
		instance.bgmList[(int)bgm].Stop();
	}
}
